In [1]:
import numpy as np
import pandas as pd

## Object creation

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

### Creating a DataFrame by passing a NumPy array

In [4]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.rand(6, 4), index = dates, columns = list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.419213  0.675750  0.882846  0.782031
2013-01-02  0.962701  0.834731  0.029241  0.604499
2013-01-03  0.752402  0.994504  0.001049  0.785435
2013-01-04  0.538102  0.605392  0.379181  0.350910
2013-01-05  0.287651  0.724494  0.607662  0.723214
2013-01-06  0.845504  0.805472  0.816232  0.430242

### Creating a DataFrame by passing a dict of objects that can be converted to series like

In [6]:
df2 = pd.DataFrame({"A":1.0, "B": pd.Timestamp("20130102"),"C": pd.Series(1, index=list(range(4)), dtype="float32"),"D": np.array([3] * 4, dtype="int32")})

df2

     A          B    C  D
0  1.0 2013-01-02  1.0  3
1  1.0 2013-01-02  1.0  3
2  1.0 2013-01-02  1.0  3
3  1.0 2013-01-02  1.0  3

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
dtype: object

# Viewing data

In [8]:
df.head()

                   A         B         C         D
2013-01-01  0.419213  0.675750  0.882846  0.782031
2013-01-02  0.962701  0.834731  0.029241  0.604499
2013-01-03  0.752402  0.994504  0.001049  0.785435
2013-01-04  0.538102  0.605392  0.379181  0.350910
2013-01-05  0.287651  0.724494  0.607662  0.723214

In [9]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.538102  0.605392  0.379181  0.350910
2013-01-05  0.287651  0.724494  0.607662  0.723214
2013-01-06  0.845504  0.805472  0.816232  0.430242

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

### DataFrame.to_numpy()

In [12]:
df.to_numpy()

array([[0.4192129 , 0.67575049, 0.88284622, 0.78203102],
       [0.96270106, 0.834731  , 0.02924059, 0.60449878],
       [0.75240245, 0.9945042 , 0.0010493 , 0.78543481],
       [0.53810185, 0.60539226, 0.37918097, 0.35090966],
       [0.28765138, 0.72449442, 0.60766228, 0.72321435],
       [0.84550396, 0.80547231, 0.81623171, 0.43024165]])

In [13]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3]], dtype=object)

In [14]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.634262  0.773391  0.452702  0.612722
std    0.261566  0.136990  0.382075  0.185804
min    0.287651  0.605392  0.001049  0.350910
25%    0.448935  0.687936  0.116726  0.473806
50%    0.645252  0.764983  0.493422  0.663857
75%    0.822229  0.827416  0.764089  0.767327
max    0.962701  0.994504  0.882846  0.785435

In [15]:
# Transpose your data
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.419213    0.962701    0.752402    0.538102    0.287651    0.845504
B    0.675750    0.834731    0.994504    0.605392    0.724494    0.805472
C    0.882846    0.029241    0.001049    0.379181    0.607662    0.816232
D    0.782031    0.604499    0.785435    0.350910    0.723214    0.430242

In [16]:
# sorting by axis
df.sort_index(axis=1, ascending = False)

                   D         C         B         A
2013-01-01  0.782031  0.882846  0.675750  0.419213
2013-01-02  0.604499  0.029241  0.834731  0.962701
2013-01-03  0.785435  0.001049  0.994504  0.752402
2013-01-04  0.350910  0.379181  0.605392  0.538102
2013-01-05  0.723214  0.607662  0.724494  0.287651
2013-01-06  0.430242  0.816232  0.805472  0.845504

In [17]:
# Sorting by values:
df.sort_values(by = 'B', ascending=False)

                   A         B         C         D
2013-01-03  0.752402  0.994504  0.001049  0.785435
2013-01-02  0.962701  0.834731  0.029241  0.604499
2013-01-06  0.845504  0.805472  0.816232  0.430242
2013-01-05  0.287651  0.724494  0.607662  0.723214
2013-01-01  0.419213  0.675750  0.882846  0.782031
2013-01-04  0.538102  0.605392  0.379181  0.350910

# Selection

In [18]:
# recommeded optimized pandas data access methods are .at, .iat, .loc and .iloc

### Getting

In [19]:
df["A"]

2013-01-01    0.419213
2013-01-02    0.962701
2013-01-03    0.752402
2013-01-04    0.538102
2013-01-05    0.287651
2013-01-06    0.845504
Freq: D, Name: A, dtype: float64

In [20]:
#selecting via [] which slices the row
df[0:3]

                   A         B         C         D
2013-01-01  0.419213  0.675750  0.882846  0.782031
2013-01-02  0.962701  0.834731  0.029241  0.604499
2013-01-03  0.752402  0.994504  0.001049  0.785435

In [21]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  0.962701  0.834731  0.029241  0.604499
2013-01-03  0.752402  0.994504  0.001049  0.785435
2013-01-04  0.538102  0.605392  0.379181  0.350910

### Selection by lable

In [22]:
df

                   A         B         C         D
2013-01-01  0.419213  0.675750  0.882846  0.782031
2013-01-02  0.962701  0.834731  0.029241  0.604499
2013-01-03  0.752402  0.994504  0.001049  0.785435
2013-01-04  0.538102  0.605392  0.379181  0.350910
2013-01-05  0.287651  0.724494  0.607662  0.723214
2013-01-06  0.845504  0.805472  0.816232  0.430242

In [23]:
# For getting a cross section using a label:
df.loc[dates[0]]

A    0.419213
B    0.675750
C    0.882846
D    0.782031
Name: 2013-01-01 00:00:00, dtype: float64

In [24]:
# Selecting on a multi-axis by label:
df.loc[:,["A", "B"]]

                   A         B
2013-01-01  0.419213  0.675750
2013-01-02  0.962701  0.834731
2013-01-03  0.752402  0.994504
2013-01-04  0.538102  0.605392
2013-01-05  0.287651  0.724494
2013-01-06  0.845504  0.805472

In [25]:
df.loc[:,["A"]]

                   A
2013-01-01  0.419213
2013-01-02  0.962701
2013-01-03  0.752402
2013-01-04  0.538102
2013-01-05  0.287651
2013-01-06  0.845504

In [26]:
# showing label slicing, both endpoints are included:
df.loc["20130102":"20130104",["A","B"]]

                   A         B
2013-01-02  0.962701  0.834731
2013-01-03  0.752402  0.994504
2013-01-04  0.538102  0.605392

In [27]:
# Reduction in the dimensions of the returned object
df.loc["20130102", ["A","B"]]

A    0.962701
B    0.834731
Name: 2013-01-02 00:00:00, dtype: float64

In [28]:
# for getting the scalar value
df.loc[dates[0], "A"]

0.4192128989260723

In [29]:
# for getting the fast access to a scalar 
df.at[dates[0],"A"]

0.4192128989260723

### Selection by position

In [30]:
# Select via the position of the passed integers
df.iloc[3]

A    0.538102
B    0.605392
C    0.379181
D    0.350910
Name: 2013-01-04 00:00:00, dtype: float64

In [31]:
# by integer slices
df.iloc[3:5:,0:2]

                   A         B
2013-01-04  0.538102  0.605392
2013-01-05  0.287651  0.724494

In [32]:
# By lists of integer position locations
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02  0.962701  0.029241
2013-01-03  0.752402  0.001049
2013-01-05  0.287651  0.607662

In [33]:
# for slicing columns explicitly:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.962701  0.834731  0.029241  0.604499
2013-01-03  0.752402  0.994504  0.001049  0.785435

In [34]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.675750  0.882846
2013-01-02  0.834731  0.029241
2013-01-03  0.994504  0.001049
2013-01-04  0.605392  0.379181
2013-01-05  0.724494  0.607662
2013-01-06  0.805472  0.816232

In [35]:
# for getting the values explicitly:
df.iloc[1,1]

0.8347310031149034

In [36]:
# for fast accessing to a scalar 
df.iat[1,1]

0.8347310031149034

### Boolean indexing

In [37]:
# Using a single column's values to select data

df[df["A"]>0]

                   A         B         C         D
2013-01-01  0.419213  0.675750  0.882846  0.782031
2013-01-02  0.962701  0.834731  0.029241  0.604499
2013-01-03  0.752402  0.994504  0.001049  0.785435
2013-01-04  0.538102  0.605392  0.379181  0.350910
2013-01-05  0.287651  0.724494  0.607662  0.723214
2013-01-06  0.845504  0.805472  0.816232  0.430242

In [38]:
# select values from a DataFrame where a boolean conditon is met
df[df>0]

                   A         B         C         D
2013-01-01  0.419213  0.675750  0.882846  0.782031
2013-01-02  0.962701  0.834731  0.029241  0.604499
2013-01-03  0.752402  0.994504  0.001049  0.785435
2013-01-04  0.538102  0.605392  0.379181  0.350910
2013-01-05  0.287651  0.724494  0.607662  0.723214
2013-01-06  0.845504  0.805472  0.816232  0.430242

In [39]:
# Using the isin() method for filtering 
df2 = df.copy()

In [40]:
df2["E"]=["one", "one", "two", "three", "four", "three"]

In [41]:
df2

                   A         B         C         D      E
2013-01-01  0.419213  0.675750  0.882846  0.782031    one
2013-01-02  0.962701  0.834731  0.029241  0.604499    one
2013-01-03  0.752402  0.994504  0.001049  0.785435    two
2013-01-04  0.538102  0.605392  0.379181  0.350910  three
2013-01-05  0.287651  0.724494  0.607662  0.723214   four
2013-01-06  0.845504  0.805472  0.816232  0.430242  three

In [42]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03  0.752402  0.994504  0.001049  0.785435   two
2013-01-05  0.287651  0.724494  0.607662  0.723214  four

### Setting

In [43]:
# setting a new column automatically aligns the data by the indexes

s1 = pd.Series([1,2,3,4,5,6], index = pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [44]:
df["F"] = s1

In [45]:
# Setting values by label
df.at[dates[0], "A"] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.675750  0.882846  0.782031  NaN
2013-01-02  0.962701  0.834731  0.029241  0.604499  1.0
2013-01-03  0.752402  0.994504  0.001049  0.785435  2.0
2013-01-04  0.538102  0.605392  0.379181  0.350910  3.0
2013-01-05  0.287651  0.724494  0.607662  0.723214  4.0
2013-01-06  0.845504  0.805472  0.816232  0.430242  5.0

In [46]:
df.iat[0,1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  0.882846  0.782031  NaN
2013-01-02  0.962701  0.834731  0.029241  0.604499  1.0
2013-01-03  0.752402  0.994504  0.001049  0.785435  2.0
2013-01-04  0.538102  0.605392  0.379181  0.350910  3.0
2013-01-05  0.287651  0.724494  0.607662  0.723214  4.0
2013-01-06  0.845504  0.805472  0.816232  0.430242  5.0

In [47]:
df.loc[:, "D"] = np.array([5]*len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.882846  5  NaN
2013-01-02  0.962701  0.834731  0.029241  5  1.0
2013-01-03  0.752402  0.994504  0.001049  5  2.0
2013-01-04  0.538102  0.605392  0.379181  5  3.0
2013-01-05  0.287651  0.724494  0.607662  5  4.0
2013-01-06  0.845504  0.805472  0.816232  5  5.0

In [48]:
# A Where operation with setting
df2 = df.copy()
df2[df2>0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.882846 -5  NaN
2013-01-02 -0.962701 -0.834731 -0.029241 -5 -1.0
2013-01-03 -0.752402 -0.994504 -0.001049 -5 -2.0
2013-01-04 -0.538102 -0.605392 -0.379181 -5 -3.0
2013-01-05 -0.287651 -0.724494 -0.607662 -5 -4.0
2013-01-06 -0.845504 -0.805472 -0.816232 -5 -5.0

### Missing data

In [50]:
# Reindexing allows you to change/add/delete the index on a specifie axis
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+["E"])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.882846  5  NaN  1.0
2013-01-02  0.962701  0.834731  0.029241  5  1.0  1.0
2013-01-03  0.752402  0.994504  0.001049  5  2.0  NaN
2013-01-04  0.538102  0.605392  0.379181  5  3.0  NaN

In [51]:
# To drop any rows that have missing data
df1.dropna(how="any")

                   A         B         C  D    F    E
2013-01-02  0.962701  0.834731  0.029241  5  1.0  1.0

In [53]:
# Filling missing data
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.882846  5  5.0  1.0
2013-01-02  0.962701  0.834731  0.029241  5  1.0  1.0
2013-01-03  0.752402  0.994504  0.001049  5  2.0  5.0
2013-01-04  0.538102  0.605392  0.379181  5  3.0  5.0

In [54]:
# to get the boolean mask where values are nan
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# Operations

In [58]:
df.mean()

A    0.564393
B    0.660766
C    0.452702
D    5.000000
F    3.000000
dtype: float64

In [56]:
# perform mean on the other axis
df.mean(1)

2013-01-01    1.470712
2013-01-02    1.565335
2013-01-03    1.749591
2013-01-04    1.904535
2013-01-05    2.123962
2013-01-06    2.493442
Freq: D, dtype: float64

In [62]:
# Operating with the objects that have different dimensionality and you need alignment
s = pd.Series([1,3,5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [63]:
df.sub(s, axis="index")

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.247598 -0.005496 -0.998951  4.0  1.0
2013-01-04 -2.461898 -2.394608 -2.620819  2.0  0.0
2013-01-05 -4.712349 -4.275506 -4.392338  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

### Apply

In [64]:
# Apply functions to the data:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  0.882846   5   NaN
2013-01-02  0.962701  0.834731  0.912087  10   1.0
2013-01-03  1.715104  1.829235  0.913136  15   3.0
2013-01-04  2.253205  2.434627  1.292317  20   6.0
2013-01-05  2.540857  3.159122  1.899979  25  10.0
2013-01-06  3.386361  3.964594  2.716211  30  15.0

In [65]:
df.apply(lambda x: x.max()-x.min())

A    0.962701
B    0.994504
C    0.881797
D    0.000000
F    4.000000
dtype: float64

## Histogramming

In [67]:
s=pd.Series(np.random.randint(0, 7, size=10))
s

0    3
1    6
2    6
3    3
4    6
5    2
6    5
7    3
8    1
9    6
dtype: int64

In [78]:
s.value_counts()

6    4
3    3
5    1
2    1
1    1
dtype: int64

### String Methods

In [79]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

### Merge

In [81]:
# Concatenating pandas objects together with concat()
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0  0.732171  0.585644 -0.491000  0.348066
1 -1.406852  1.031933 -1.026581  0.301722
2 -1.638157  0.835381 -0.005459  0.102161
3  0.021324  0.460355 -0.025934  0.955158
4  0.334088  2.234777  0.249088  0.067133
5  1.242142  0.741681  0.522324  0.203410
6 -0.900648 -1.181710 -1.424708 -1.175877
7 -1.380469 -0.452201 -1.498406 -0.126577
8 -1.032076  2.324669  0.470916  0.365224
9 -0.852767 -1.870842 -0.424565 -0.049302

In [83]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  0.732171  0.585644 -0.491000  0.348066
 1 -1.406852  1.031933 -1.026581  0.301722
 2 -1.638157  0.835381 -0.005459  0.102161,
           0         1         2         3
 3  0.021324  0.460355 -0.025934  0.955158
 4  0.334088  2.234777  0.249088  0.067133
 5  1.242142  0.741681  0.522324  0.203410
 6 -0.900648 -1.181710 -1.424708 -1.175877,
           0         1         2         3
 7 -1.380469 -0.452201 -1.498406 -0.126577
 8 -1.032076  2.324669  0.470916  0.365224
 9 -0.852767 -1.870842 -0.424565 -0.049302]

In [84]:
pd.concat(pieces)

          0         1         2         3
0  0.732171  0.585644 -0.491000  0.348066
1 -1.406852  1.031933 -1.026581  0.301722
2 -1.638157  0.835381 -0.005459  0.102161
3  0.021324  0.460355 -0.025934  0.955158
4  0.334088  2.234777  0.249088  0.067133
5  1.242142  0.741681  0.522324  0.203410
6 -0.900648 -1.181710 -1.424708 -1.175877
7 -1.380469 -0.452201 -1.498406 -0.126577
8 -1.032076  2.324669  0.470916  0.365224
9 -0.852767 -1.870842 -0.424565 -0.049302

### Adding a column to a DataFrame is relatively fast. However, adding a row requires a copy, and may be expensive. We recommend passing a pre-built list of records to the DataFrame constructor instead of building a DataFrame by iteratively appending records to it. See Appending to dataframe for more

## Join

In [86]:
left = pd.DataFrame({"key":["foo", "foo"], "lval":[1, 2]})
right = pd.DataFrame({"key":["foo", "foo"], "rval":[3, 4]})

In [88]:
left

   key  lval
0  foo     1
1  foo     2

In [89]:
right

   key  rval
0  foo     3
1  foo     4

In [90]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     3
1  foo     1     4
2  foo     2     3
3  foo     2     4

In [104]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})

In [105]:
left

   key  lval
0  foo     1
1  bar     2

In [106]:
right

   key  rval
0  foo     4
1  bar     5

In [107]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  bar     2     5

### Grouping
- **Splitting** : the data into groups based on some criteria
- **Applying** : a function to each group independently
- **Combining** : the result into a data structure

In [108]:
df = pd.DataFrame({
    "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
    "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
    "C": np.random.randn(8),
    "D": np.random.randn(8),
})

In [109]:
df

     A      B         C         D
0  foo    one -1.232557  0.403547
1  bar    one -0.064487  1.099701
2  foo    two -1.041160  0.909385
3  bar  three  0.241677 -0.583996
4  foo    two  0.032040 -0.951358
5  bar    two  2.140241 -0.859851
6  foo    one -0.103597 -0.491298
7  foo  three  0.223722 -1.581347

In [110]:
# Grouping and then applying the sum() function to the resulting groups
df.groupby("A").sum()

            C         D
A
bar  2.317432 -0.344146
foo -2.121552 -1.711072

In [111]:
# Grouping by multiple columns forms a hierarchial index, and again we can apply the sum() function
df.groupby(["A","B"]).sum()

                  C         D
A   B
bar one   -0.064487  1.099701
    three  0.241677 -0.583996
    two    2.140241 -0.859851
foo one   -1.336154 -0.087752
    three  0.223722 -1.581347
    two   -1.009120 -0.041974

## Reshaping

### Stack

In [115]:
tuples = list(
    zip(
         *[
             ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
             ["one", "two", "one", "two", "one", "two", "one", "two"],
         ]
    )
)
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [125]:
index = pd.MultiIndex.from_tuples(tuples, names=["first", "second"])

In [128]:
df= pd.DataFrame(np.random.randn(8,2), index=index, columns=["A","B"])
df

                     A         B
first second
bar   one     0.481939 -0.498348
      two     1.515486 -0.378012
baz   one     0.122791 -2.309412
      two    -2.636340 -0.119350
foo   one    -0.276212  1.312323
      two    -0.210253 -1.636917
qux   one    -0.040002  0.169056
      two     0.760360 -0.289843

In [127]:
df2 = df[:4]
df2

                     A         B
first second
bar   one     0.249296  0.635068
      two    -1.429030 -0.837623
baz   one    -0.812271  0.918998
      two     1.330081  0.707422

In [130]:
# The stack() method "compresses" a level in the DataFrame's column
stacked = df2.stack()
stacked

first  second
bar    one     A    0.249296
               B    0.635068
       two     A   -1.429030
               B   -0.837623
baz    one     A   -0.812271
               B    0.918998
       two     A    1.330081
               B    0.707422
dtype: float64

In [131]:
# with a "stacked" DataFrame or Series (having a MultiIndex as the index), the inverse operation of stack()
# is unstack(), which by default unstacks the last level:
stacked.unstack()

                     A         B
first second
bar   one     0.249296  0.635068
      two    -1.429030 -0.837623
baz   one    -0.812271  0.918998
      two     1.330081  0.707422

In [133]:
stacked.unstack(1)

second        one       two
first
bar   A  0.249296 -1.429030
      B  0.635068 -0.837623
baz   A -0.812271  1.330081
      B  0.918998  0.707422

In [134]:
stacked.unstack(0)

first          bar       baz
second
one    A  0.249296 -0.812271
       B  0.635068  0.918998
two    A -1.429030  1.330081
       B -0.837623  0.707422

## Pivot tables

In [138]:
df=pd.DataFrame(
{
    "A": ["one", "one", "two", "three"]*3,
    "B": ["A", "B", "C"]*4,
    "C": ["foo", "foo", "foo", "bar", "bar", "bar"]*2,
    "D": np.random.randn(12),
    "E": np.random.randn(12)
}
)
df

        A  B    C         D         E
0     one  A  foo -1.290326 -1.756499
1     one  B  foo -0.876236  1.542959
2     two  C  foo -1.057725  0.878522
3   three  A  bar -1.189909  1.359355
4     one  B  bar -0.042003 -1.055063
5     one  C  bar -0.146330  1.252074
6     two  A  foo  0.753001  0.589163
7   three  B  foo  0.607564  0.297592
8     one  C  foo  0.679660  0.404265
9     one  A  bar -0.945475 -0.676575
10    two  B  bar  0.750327 -1.199845
11  three  C  bar  2.509593  3.100995

In [139]:
pd.pivot_table(df, values="D", index=["A","B"], columns=["C"])

C             bar       foo
A     B
one   A -0.945475 -1.290326
      B -0.042003 -0.876236
      C -0.146330  0.679660
three A -1.189909       NaN
      B       NaN  0.607564
      C  2.509593       NaN
two   A       NaN  0.753001
      B  0.750327       NaN
      C       NaN -1.057725

## Time Series

In [147]:
# pandas has simple, powerful, and efficient functionality for performing resampling operations during frequency
# conversion (e.g., converting secondly data into 5-minutely data).
rng = pd.date_range("1/1/2012", periods=100, freq="S")
rng
ts = pd.Series(np.random.randint(0, 500, len(rng)), index= rng)
ts.resample("5min").sum()

2012-01-01    27005
Freq: 5T, dtype: int64

In [151]:
rng = pd.date_range("3/6/2012 00:00", periods=5, freq="D")
ts=pd.Series(np.random.randn(len(rng)), rng)
ts

2012-03-06   -1.028656
2012-03-07    0.002180
2012-03-08    0.419110
2012-03-09   -1.216217
2012-03-10    0.184053
Freq: D, dtype: float64

In [152]:
ts_utc = ts.tz_localize("UTC")
ts_utc

2012-03-06 00:00:00+00:00   -1.028656
2012-03-07 00:00:00+00:00    0.002180
2012-03-08 00:00:00+00:00    0.419110
2012-03-09 00:00:00+00:00   -1.216217
2012-03-10 00:00:00+00:00    0.184053
Freq: D, dtype: float64

In [154]:
# converting to another time zone:
ts_utc.tz_convert("US/Eastern")

2012-03-05 19:00:00-05:00   -1.028656
2012-03-06 19:00:00-05:00    0.002180
2012-03-07 19:00:00-05:00    0.419110
2012-03-08 19:00:00-05:00   -1.216217
2012-03-09 19:00:00-05:00    0.184053
Freq: D, dtype: float64

In [155]:
# converting between time span representations:
rng = pd.date_range("1/1/2012", periods=5, freq="M")
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2012-01-31   -0.236659
2012-02-29    0.961136
2012-03-31    0.878502
2012-04-30    0.753755
2012-05-31   -1.038313
Freq: M, dtype: float64

In [156]:
ps = ts.to_period()
ps

2012-01   -0.236659
2012-02    0.961136
2012-03    0.878502
2012-04    0.753755
2012-05   -1.038313
Freq: M, dtype: float64

In [158]:
ps.to_timestamp()

2012-01-01   -0.236659
2012-02-01    0.961136
2012-03-01    0.878502
2012-04-01    0.753755
2012-05-01   -1.038313
Freq: MS, dtype: float64

## Categoricals